api/models/User.php

UPDATE `user` SET `allowance_updated_at`=1490938869 WHERE `id`=1
---
    public  function saveAllowance($request, $action, $allowance, $timestamp){
        $this->allowance = $allowance;
        $this->allowance_updated_at = $timestamp;
        $this->save();

SELECT * FROM `user` WHERE (`access_token`='123') AND (`status`=1)
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token,'status'=>self::STATUS_ACTIVE]);